import s from './footer.module.scss'

export const Footer = () => {
    return (
        <footer className={s.footer}>
            <div className="container">
                <div className={s.footer__wrapper}>
                    <div className={s.footer__social}>
                        <a href="" className={s.footer__social_link}>
                            <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0)">
                                    <path
                                        d="M29.9999 15.0007C29.9999 23.3841 23.3556 30.0244 14.9904 29.9991C6.63459 29.9739 -0.0254051 23.2862 -0.000141989 14.9439C0.0251212 6.6395 6.80828 -0.0608451 15.1293 -0.000851465C23.4156 0.0591422 29.9999 6.69949 29.9999 15.0007ZM15.0409 5.79012C13.7778 5.79012 12.5146 5.78064 11.2514 5.79327C7.94512 5.82485 5.76617 8.02251 5.74091 11.3727C5.72196 13.7945 5.72196 16.2132 5.74091 18.6351C5.76617 21.9221 7.79038 24.1419 11.0588 24.2808C13.6862 24.3913 16.323 24.3913 18.9504 24.2808C22.0451 24.1513 24.1451 21.9979 24.243 18.9098C24.3251 16.3332 24.3251 13.7503 24.243 11.1769C24.1388 7.90884 21.9283 5.82801 18.6725 5.79643C17.463 5.78064 16.2504 5.79012 15.0409 5.79012Z"
                                        fill="black"/>
                                    <path
                                        d="M22.4716 15.0647C22.4716 16.4319 22.5031 17.796 22.4621 19.1632C22.4052 21.1241 21.0284 22.5292 19.0673 22.5639C16.3894 22.6113 13.7084 22.605 11.0305 22.5671C8.98419 22.5387 7.53787 21.2188 7.45892 19.138C7.35787 16.4098 7.35787 13.6722 7.45261 10.9441C7.52524 8.80643 8.98419 7.46763 11.1284 7.42973C13.7021 7.38553 16.2789 7.38237 18.8526 7.42973C21.0852 7.47078 22.44 8.89169 22.4716 11.1209C22.4873 12.4376 22.4747 13.7512 22.4716 15.0647ZM14.9747 10.2621C12.3947 10.2715 10.2126 12.3903 10.1684 14.9289C10.1242 17.4708 12.4231 19.7442 15.0252 19.7316C17.5673 19.719 19.8031 17.5339 19.8347 15.0363C19.8663 12.4566 17.6242 10.2526 14.9747 10.2621ZM21.3252 9.9621C20.7379 9.52004 20.3147 8.97062 20.0116 9.03062C19.5947 9.11271 19.2726 9.65582 18.9094 10.0031C19.2821 10.3568 19.6137 10.9031 20.0431 10.9946C20.3242 11.0546 20.7442 10.4547 21.3252 9.9621Z"
                                        fill="black"/>
                                    <path
                                        d="M18.0505 14.9763C18.0537 16.7414 16.7432 18.0834 15.0063 18.0897C13.2884 18.096 11.9147 16.7225 11.9147 14.9984C11.9147 13.2744 13.2695 11.9072 14.9874 11.8977C16.7147 11.8914 18.0474 13.227 18.0505 14.9763Z"
                                        fill="black"/>
                                </g>
                                <defs>
                                    <clipPath id="clip0">
                                        <rect width="30" height="30" fill="white"/>
                                    </clipPath>
                                </defs>
                            </svg>
                        </a>
                        <a href="" className={s.footer__social_link}>
                            <svg width="31" height="31" viewBox="0 0 31 31" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M31.0001 15.6226C30.974 24.2625 24.0789 31.0524 15.3761 30.997C6.84944 30.948 -0.0260312 24.0113 7.4093e-05 15.4855C0.0261794 6.89129 7.01586 -0.0454551 15.5947 0.000224315C24.2258 0.0491665 31.0262 6.94349 31.0001 15.6226ZM15.6632 9.31556C15.6632 9.32535 15.6632 9.33514 15.6632 9.34819C13.6597 9.34819 11.6528 9.30577 9.64923 9.36124C8.12207 9.40366 7.18555 10.2618 7.13986 11.7953C7.06807 14.1739 7.07134 16.559 7.14639 18.9376C7.19534 20.4222 8.1906 21.2542 9.58723 21.277C13.6531 21.3423 17.719 21.3227 21.7849 21.2444C23.237 21.2183 24.0854 20.3047 24.1181 18.8332C24.1703 16.5655 24.2258 14.2881 24.1148 12.0237C24.0202 10.1052 23.2435 9.40039 21.3509 9.32861C19.4583 9.26009 17.5624 9.31556 15.6632 9.31556Z"
                                    fill="black"/>
                                <path
                                    d="M18.688 15.2383C16.8868 16.1845 15.4184 16.9545 13.79 17.8061C13.79 16.054 13.79 14.5302 13.79 12.7324C15.4249 13.5677 16.8868 14.3149 18.688 15.2383Z"
                                    fill="black"/>
                            </svg>
                        </a>
                        <a href="" className={s.footer__social_link}>
                            <svg width="30" height="31" viewBox="0 0 30 31" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M30 15.5662C29.9842 24.2821 23.3369 31.0173 14.7727 31.001C6.56529 30.9847 -0.0157611 24.0407 2.83525e-05 15.4129C0.0158178 6.92867 6.76108 -0.00554515 15 0.000981166C23.3211 0.00750748 30.0158 6.95477 30 15.5662ZM19.2695 5.0393C17.1758 5.44393 15.1706 5.40803 13.5885 6.24014C11.3937 7.3953 12.4358 10.0156 12.079 12.0061C11.4158 12.104 10.8158 12.1921 10.1969 12.2835C10.1969 13.4093 10.1969 14.4176 10.1969 15.501C10.8285 15.5728 11.3874 15.638 12.1958 15.7294C12.1958 19.0839 12.1958 22.4091 12.1958 25.6886C13.6769 25.6886 14.9021 25.6886 16.2979 25.6886C16.2979 22.2688 16.2979 18.9893 16.2979 15.7359C19.3232 15.4259 19.4116 15.315 19.1432 12.2117C18.2369 12.1595 17.3148 12.1073 16.4116 12.0584C15.9348 9.48372 15.9348 9.48372 19.2695 8.61572C19.2695 7.61067 19.2695 6.60561 19.2695 5.0393Z"
                                    fill="black"/>
                            </svg>
                        </a>
                        <h2 className={[s.footer__social_title, s.footer__title].join(' ')}>
                            ПОДПИШИСЬ В СОЦ СЕТЯХ
                        </h2>
                    </div>
                    <div className={s.footer__contact}>
                        <div className={s.footer__contact_block}>
                            <h2 className={[s.footer__social_title, s.footer__title].join(' ')}>ЮРИДИЧЕСКОЕ ЛИЦО </h2>
                            <p className={s.footer__contact_text}>Мы живем в мире, который требует непрерывного улучшения.
                                Мы не можем
                                сказать - все прекрасно!</p>
                        </div>
                        <div className={s.footer__contact_block}>
                            <h2 className={[s.footer__social_title, s.footer__title].join(' ')}>ОГРНИП</h2>
                            <p className={s.footer__contact_text}>Мы живем в мире, который требует непрерывного улучшения.
                                Мы не можем
                                сказать - все прекрасно!</p>
                        </div>
                        <div className={s.footer__contact_block}>
                            <h2 className={[s.footer__social_title, s.footer__title].join(' ')}>КОНТАКТЫ</h2>
                            <div className={s.footer__contact_row}>
                                <div className={s.footer__contact_number}>
                                    <a href="#" className={s.footer__contact_link}>+7 (495) 956-82-83</a>
                                    <a href="#" className={s.footer__contact_link}>+7 (495) 787-92-92</a>
                                </div>
                                <a href="#" className={s.footer__contact_link}>contact@consultant.ru</a>
                            </div>
                        </div>
                    </div>
                    <div className={s.footer__subscribe}>
                        <h2 className={[s.footer__subscribe_title, s.footer__title].join(' ')}>РАССЫЛКА НОВОСТЕЙ НА ВАШУ ПОЧТУ</h2>
                        <input className={s.footer__subscribe_input} type="text" name="email" placeholder="email" />
                    </div>
                </div>
            </div>
        </footer>
    )
}